In [1]:
import pandas as p
a=p.Series([1,2,3],index=["one","two","three"])
print(a)

one      1
two      2
three    3
dtype: int64

In [2]:
b=p.DataFrame({"abc":[123,1],"def":[456,2],"ghi":[789,3]})
print(b)

   abc  def  ghi
0  123  456  789
1    1    2    3

In [3]:
b["abc"]

0    123
1      1
Name: abc, dtype: int64

In [4]:
b.describe()

              abc         def        ghi
count    2.000000    2.000000    2.00000
mean    62.000000  229.000000  396.00000
std     86.267027  321.026479  555.78593
min      1.000000    2.000000    3.00000
25%     31.500000  115.500000  199.50000
50%     62.000000  229.000000  396.00000
75%     92.500000  342.500000  592.50000
max    123.000000  456.000000  789.00000

In [5]:
print(b["abc"][0])

123

In [6]:
d1={1:"one",2:"two",3:"three"}
d=p.Series(d1)
print(d)

1      one
2      two
3    three
dtype: object

In [7]:
data=p.read_csv("students.csv")
print(data)

    ID      NAME BRANCH  CGPA  MARKS
0  596    bhagya    cse  9.50    450
1  766      teja    ece  9.70    470
2  373  poojitha    cse  9.72    478
3  992      neha    ece  9.89    490
4  305     satya     ce  9.74    479
5  999     sailu    eee  9.80    480
6  420    geetha    cse  9.70    470
7  191   sumathi     ce  9.89    490
8  895     madhu     ce  9.75    475
9  425   dharani    ece  9.95    495

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
ID        10 non-null int64
NAME      10 non-null object
BRANCH    10 non-null object
CGPA      10 non-null float64
MARKS     10 non-null int64
dtypes: float64(1), int64(2), object(2)
memory usage: 528.0+ bytes

In [9]:
data.head()

    ID      NAME BRANCH  CGPA  MARKS
0  596    bhagya    cse  9.50    450
1  766      teja    ece  9.70    470
2  373  poojitha    cse  9.72    478
3  992      neha    ece  9.89    490
4  305     satya     ce  9.74    479

In [10]:
data.tail()

    ID     NAME BRANCH  CGPA  MARKS
5  999    sailu    eee  9.80    480
6  420   geetha    cse  9.70    470
7  191  sumathi     ce  9.89    490
8  895    madhu     ce  9.75    475
9  425  dharani    ece  9.95    495

In [11]:
data.head(7)

    ID      NAME BRANCH  CGPA  MARKS
0  596    bhagya    cse  9.50    450
1  766      teja    ece  9.70    470
2  373  poojitha    cse  9.72    478
3  992      neha    ece  9.89    490
4  305     satya     ce  9.74    479
5  999     sailu    eee  9.80    480
6  420    geetha    cse  9.70    470

In [11]:
data.tail(10)

    ID      NAME BRANCH  CGPA  MARKS
0  596    bhagya    cse  9.50    450
1  766      teja    ece  9.70    470
2  373  poojitha    cse  9.72    478
3  992      neha    ece  9.89    490
4  305     satya     ce  9.74    479
5  999     sailu    eee  9.80    480
6  420    geetha    cse  9.70    470
7  191   sumathi     ce  9.89    490
8  895     madhu     ce  9.75    475
9  425   dharani    ece  9.95    495

In [13]:
print(type(data))

<class 'pandas.core.frame.DataFrame'>

In [14]:
data["NAME"]

0      bhagya
1        teja
2    poojitha
3        neha
4       satya
5       sailu
6      geetha
7     sumathi
8       madhu
9     dharani
Name: NAME, dtype: object

In [15]:
data[["NAME"]]

       NAME
0    bhagya
1      teja
2  poojitha
3      neha
4     satya
5     sailu
6    geetha
7   sumathi
8     madhu
9   dharani

In [15]:
data[["NAME","ID"]]

       NAME   ID
0    bhagya  596
1      teja  766
2  poojitha  373
3      neha  992
4     satya  305
5     sailu  999
6    geetha  420
7   sumathi  191
8     madhu  895
9   dharani  425

In [16]:
data["MARKS"]>470

0    False
1    False
2     True
3     True
4     True
5     True
6    False
7     True
8     True
9     True
Name: MARKS, dtype: bool

In [18]:
data[data["MARKS"]>470]

    ID      NAME BRANCH  CGPA  MARKS
2  373  poojitha    cse  9.72    478
3  992      neha    ece  9.89    490
4  305     satya     ce  9.74    479
5  999     sailu    eee  9.80    480
7  191   sumathi     ce  9.89    490
8  895     madhu     ce  9.75    475
9  425   dharani    ece  9.95    495

In [24]:
data["CGPA"].max()

9.95

In [19]:
data.describe()

               ID      CGPA       MARKS
count   10.000000  10.00000   10.000000
mean   596.200000   9.76400  477.700000
std    297.429282   0.12834   12.918978
min    191.000000   9.50000  450.000000
25%    384.750000   9.70500  471.250000
50%    510.500000   9.74500  478.500000
75%    862.750000   9.86750  487.500000
max    999.000000   9.95000  495.000000

In [27]:
data[["MARKS","CGPA"]].max()

MARKS    495.00
CGPA       9.95
dtype: float64

In [28]:
data[["MARKS","CGPA"]].mean()

MARKS    477.700
CGPA       9.764
dtype: float64

In [29]:
data.display()

AttributeError: 'DataFrame' object has no attribute 'display'

In [30]:
data.head(7).tail(2)

    ID    NAME BRANCH  CGPA  MARKS
5  999   sailu    eee   9.8    480
6  420  geetha    cse   9.7    470

In [33]:
data[data["MARKS"]<=470]["MARKS"]

0    450
1    470
6    470
Name: MARKS, dtype: int64

In [32]:
data[data["MARKS"]<=470][["MARKS"]]

   MARKS
0    450
1    470
6    470

In [35]:
data.head(6).tail(2)[["MARKS"]]

   MARKS
4    479
5    480

In [4]:
data[["NAME"]]

       NAME
0    bhagya
1      teja
2  poojitha
3      neha
4     satya
5     sailu
6    geetha
7   sumathi
8     madhu
9   dharani

In [8]:
data

    ID      NAME BRANCH  CGPA  MARKS
0  596    bhagya    cse  9.50    450
1  766      teja    ece  9.70    470
2  373  poojitha    cse  9.72    478
3  992      neha    ece  9.89    490
4  305     satya     ce  9.74    479
5  999     sailu    eee  9.80    480
6  420    geetha    cse  9.70    470
7  191   sumathi     ce  9.89    490
8  895     madhu     ce  9.75    475
9  425   dharani    ece  9.95    495

In [6]:
print(data.loc[5])

ID          999
NAME      sailu
BRANCH      eee
CGPA        9.8
MARKS       480
Name: 5, dtype: object

In [7]:
print(data.iloc[1])

ID         766
NAME      teja
BRANCH     ece
CGPA       9.7
MARKS      470
Name: 1, dtype: object

In [10]:
print(data.iloc[8])

ID          895
NAME      madhu
BRANCH       ce
CGPA       9.75
MARKS       475
Name: 8, dtype: object

In [20]:
print(data.loc[1,"MARKS"])

470

In [19]:
print(data.loc[0:,"MARKS"])

0    450
1    470
2    478
3    490
4    480
5    480
6    470
7    490
8    475
9    495
Name: MARKS, dtype: int64

In [24]:
data.loc[0:]

    ID      NAME BRANCH  CGPA  MARKS REMARK
0  596    bhagya    cse  9.50    450   GOOD
1  766      teja    ece  9.70    470   GOOD
2  373  poojitha    cse  9.72    478   GOOD
3  992      neha    ece  9.89    490   GOOD
4  305    yamuna     ce  9.75    480   GOOD
5  999     sailu    eee  9.80    480   GOOD
6  420    geetha    cse  9.70    470   GOOD
7  191   sumathi     ce  9.89    490   GOOD
8  895     madhu     ce  9.75    475   GOOD
9  425   dharani    ece  9.95    495   GOOD

In [20]:
data["MARKS"]

0    450
1    470
2    478
3    490
4    480
5    480
6    470
7    490
8    475
9    495
Name: MARKS, dtype: int64

In [21]:
print(data.loc[(data["MARKS"]>475)&(data["CGPA"]>9.75)])

    ID     NAME BRANCH  CGPA  MARKS
3  992     neha    ece  9.89    490
5  999    sailu    eee  9.80    480
7  191  sumathi     ce  9.89    490
9  425  dharani    ece  9.95    495

In [22]:
data["REMARK"]="GOOD"

In [23]:
print(data)

    ID      NAME BRANCH  CGPA  MARKS REMARK
0  596    bhagya    cse  9.50    450   GOOD
1  766      teja    ece  9.70    470   GOOD
2  373  poojitha    cse  9.72    478   GOOD
3  992      neha    ece  9.89    490   GOOD
4  305     satya     ce  9.74    479   GOOD
5  999     sailu    eee  9.80    480   GOOD
6  420    geetha    cse  9.70    470   GOOD
7  191   sumathi     ce  9.89    490   GOOD
8  895     madhu     ce  9.75    475   GOOD
9  425   dharani    ece  9.95    495   GOOD

In [16]:
data.loc[4]=[305,"yamuna","ce",9.75,480,"GOOD"]

In [17]:
data

    ID      NAME BRANCH  CGPA  MARKS REMARK
0  596    bhagya    cse  9.50    450   GOOD
1  766      teja    ece  9.70    470   GOOD
2  373  poojitha    cse  9.72    478   GOOD
3  992      neha    ece  9.89    490   GOOD
4  305    yamuna     ce  9.75    480   GOOD
5  999     sailu    eee  9.80    480   GOOD
6  420    geetha    cse  9.70    470   GOOD
7  191   sumathi     ce  9.89    490   GOOD
8  895     madhu     ce  9.75    475   GOOD
9  425   dharani    ece  9.95    495   GOOD

In [23]:
data.to_excel("details_of_students.xlsx",sheet_name="student_details")
df=p.read_excel("details_of_students.xlsx")
df

   Unnamed: 0   ID      NAME BRANCH  CGPA  MARKS REMARK
0           0  596    bhagya    cse  9.50    450   GOOD
1           1  766      teja    ece  9.70    470   GOOD
2           2  373  poojitha    cse  9.72    478   GOOD
3           3  992      neha    ece  9.89    490   GOOD
4           4  305    yamuna     ce  9.75    480   GOOD
5           5  999     sailu    eee  9.80    480   GOOD
6           6  420    geetha    cse  9.70    470   GOOD
7           7  191   sumathi     ce  9.89    490   GOOD
8           8  895     madhu     ce  9.75    475   GOOD
9           9  425   dharani    ece  9.95    495   GOOD

In [25]:
data["MARKS"].min()

450

In [28]:
data[data["MARKS"]==450]

    ID    NAME BRANCH  CGPA  MARKS REMARK
0  596  bhagya    cse   9.5    450   GOOD

In [30]:
data[data["MARKS"]==450][["NAME"]]

     NAME
0  bhagya

In [32]:
data[data["MARKS"]==data["MARKS"].min()]

    ID    NAME BRANCH  CGPA  MARKS REMARK
0  596  bhagya    cse   9.5    450   GOOD

In [35]:
data[data["MARKS"]==data["MARKS"].min()]["NAME"]

0    bhagya
Name: NAME, dtype: object

In [36]:
data[["MARKS","CGPA"]].mean()

MARKS    477.800
CGPA       9.765
dtype: float64